# Taps
tap "mongodb/brew"
tap "nikitabobko/tap"
tap "derailed/k9s"

# Shell & terminal utilities
brew "coreutils"
brew "gnu-sed"
brew "util-linux"
brew "fd"
brew "fzf"
brew "ripgrep"
brew "tree"
brew "rename"
brew "pngpaste"
brew "htop"
brew "multitail"
brew "rsstail"
brew "jq"
brew "yq"
brew "xq"
brew "nnn"

# Git
brew "git"
brew "git-delta"
brew "gita"
brew "gh"
brew "glab"
brew "gitleaks"

# Terminal multiplexer
brew "tmux"
brew "tmuxinator"

# Languages & runtimes (Go needed for go install ... in bootstrap)
brew "go"

# Editor support
brew "luajit"
brew "lua-language-server"
brew "luarocks"
brew "universal-ctags"

# Languages & runtimes
brew "node"
brew "python3"
brew "ruby"
brew "poetry"
brew "maven"

# iOS / Apple dev
brew "swiftlint"
brew "xcode-build-server"
brew "xcbeautify"

# Containers & Kubernetes
brew "podman"
brew "podman-compose"
brew "minikube"
brew "kustomize"
brew "kompose"
brew "k6"
brew "derailed/k9s/k9s"

# Databases
brew "postgresql"
brew "pgcli"
brew "mycli"
brew "pgformatter"
brew "mongodb/brew/mongodb-community"

# Media
brew "imagemagick"
brew "ffmpeg"

# Monitoring
brew "prometheus"

# Debuggers
brew "debugpy"
brew "llvm"

# macOS
cask "karabiner-elements"

# Window management
cask "nikitabobko/tap/aerospace"
cask "hammerspoon"

# Apps
cask "alfred"
cask "dropbox"
cask "brave-browser"
cask "wezterm"
cask "typora"

# Fonts
cask "font-victor-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
