# Taps
tap 'mongodb/brew'
tap 'nikitabobko/tap'
tap 'derailed/k9s'

# Shell & terminal utilities
brew 'coreutils'
brew 'gnu-sed'
brew 'util-linux'
brew 'fd'
brew 'fzf'
brew 'ripgrep'
brew 'tree'
brew 'rename'
brew 'pngpaste'
brew 'htop'
brew 'multitail'
brew 'jq'
brew 'yq'
brew 'xq'
brew 'nnn'
brew 'wget'
brew 'fswatch'
brew 'eza'
brew 'bat'
brew 'grc'
brew 'colorizer'
brew 'delta' # syntax highlighting for git diffs and more
brew 'diff-so-fancy' # better git diffs
brew 'direnv'

# Git
brew 'git'
brew 'git-delta'
brew 'gh'
brew 'glab'
brew 'gitleaks'

# Languages & runtimes
brew 'go'
brew 'node'
brew 'pnpm'
brew 'python3'
brew 'pipx'
brew 'poetry'
brew 'maven'
brew 'rust'
brew 'php' # required by some Alfred workflows

# Build tools — required by mason.nvim (LSP compilation) and nvim-treesitter parsers
brew 'cmake'
brew 'ninja'

# Editor support
brew 'luajit'
brew 'lua-language-server'
brew 'luarocks'
brew 'universal-ctags'
brew 'tree-sitter-cli'

# iOS / Apple dev
brew 'swiftlint'
brew 'xcode-build-server'
brew 'xcbeautify'

# Containers & Kubernetes
brew 'podman'
brew 'podman-compose'
brew 'minikube'
brew 'kind'
brew 'kustomize'
brew 'kompose'
brew 'k6'
brew 'derailed/k9s/k9s'

# Databases
brew 'postgresql'
brew 'pgcli'
brew 'mycli'
brew 'pgformatter'
brew 'mongodb/brew/mongodb-community'

# Media
brew 'imagemagick'
brew 'ffmpeg'

# Monitoring
brew 'prometheus'

# Debuggers
brew 'llvm'

# macOS input & window management (utility casks — small, needed by config setup)
cask 'karabiner-elements'
cask 'nikitabobko/tap/aerospace'
cask 'hammerspoon'
cask 'zulu@21' # nvmim only supports Java 21, but this is needed for some LSP servers (e.g. jdtls)
